{
  "title": "JVC",
  "header": {
    "headerTitle": "My Journey into Tech",
    "welcomeMessage": "Welcome to the development log exercise! Here, I will update you all on projects I am working on, ideas for solutions, or just my thoughts blasted out into the universe.",
    "checkBackMessage": "Feel free to check back regularly for the latest information."
  },
  "mainContent": {
    "mainTitle": "Development Log",
    "logEntries": [
      {
        "entryTitle": "Welcome to My Development Log",
        "date": "2025-08-07",
        "entryNumber": 1,
        "author": "Jonathan Ramirez",
        "content": [
          "Hey all!",
           "I am Jonathan Ramirez, and I am excited to start this Developers Log",
           "This Developers Log will be used as a tool to teach HTML, CSS, Javascript, and json syntax for Cycle 58. I am a Tech Fellow and I look forward to sharing my knowledge with you all.",
           "This log will start off with the following tech stack: HTML, CSS, Javascript, and JSON. The project will evolve into a basic CRUD app Designed for Developers Logs using a SERN stack. I aim to document my own learning journey, share resources, and provide guidance to those who are also navigating the tech landscape. I hope not only to share what I have learned but what others have learned as well."
        ]
      },
      {
        "entryTitle": "Background and Experience",
        "date": "2025-08-07",
        "entryNumber": 2,
        "author": "Jonathan Ramirez",
        "content": [
          "The first couple logs will focus on my initial experiences and challenges faced while transitioning into the tech industry.",
          "I hope to provide insights and tips for others who may be on a similar path.",
          "I come from a colorful background and I have an alternative perspective on problem-solving."
        ]
      },
      {
        "entryTitle": "Learning JSON",
        "date": "2025-08-07",
        "entryNumber": 3,
        "author": "Jonathan Ramirez",
        "content": [
          "Today I learned how to add new entries to my development log using JSON.",
          "This will help me keep track of my progress and share updates more efficiently."
        ]
      }
    ]
  }
}
